================================================================================
Simple WRITE
================================================================================
WRITE lv_text.
--------------------------------------------------------------------------------

(source_file
  (write_statement
    (identifier)))

================================================================================
WRITE with position
================================================================================
WRITE / lv_text.
--------------------------------------------------------------------------------

(source_file
  (write_statement
    (identifier)))

================================================================================
WRITE with string literal
================================================================================
WRITE 'Hello World'.
--------------------------------------------------------------------------------

(source_file
  (write_statement
    (string_literal)))

================================================================================
WRITE with COLOR
================================================================================
WRITE lv_text COLOR 3.
--------------------------------------------------------------------------------

(source_file
  (write_statement
    (identifier)
    (number_literal
      (integer_literal))))
